# brew bundle

# Casks
tap 'homebrew/cask'
cask 'alacritty'
cask 'appcleaner'
cask 'choosy'
cask 'expressvpn'
cask 'firefox'
cask 'github'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kindle'
cask 'onyx'
cask 'sizeup'
cask 'transmission'
cask 'visual-studio-code'

# Work-specific
cask 'paw'
cask 'postgres-unofficial'
cask 'postico'
cask 'tunnelblick'

tap 'homebrew/homebrew-cask-fonts'
cask 'font-fira-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-powerline-symbols'

# Shell env
brew 'curl'
brew 'exa'
brew 'fzf'
brew 'z'
brew 'zsh'

brew 'bat'
brew 'cargo-watch'
brew 'chruby'
brew 'coreutils'
brew 'dua-cli'
brew 'gh'
brew 'git'
brew 'hubflow'
brew 'jq'
brew 'libsodium'
brew 'neovim'
brew 'node'
brew 'pinentry'
brew 'pinentry-mac'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby-install'
brew 'shellcheck' # Shell script linter
brew 'starship'
brew 'tmux'
brew 'tmuxinator'
brew 'tokei'
brew 'tree-sitter'

# Work-specific
brew 'cmake'
brew 'elasticsearch'
brew 'gdal'
brew 'git-lfs'
brew 'haproxy'
brew 'overmind'
brew 'rabbitmq'
brew 'redis'

# vi:ft=ruby
