# brew bundle

# Casks
tap 'homebrew/cask'
cask 'alacritty'
cask 'appcleaner'
cask 'choosy'
cask 'expressvpn'
cask 'firefox'
cask 'github'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kindle'
cask 'onyx'
cask 'paw' # work
cask 'postgres-unofficial' # work
cask 'postico' # work
cask 'sizeup'
cask 'transmission'
cask 'tunnelblick' # work
cask 'visual-studio-code'

tap 'homebrew/homebrew-cask-fonts'
cask 'font-fira-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-powerline-symbols'

# Shell env
brew 'curl'
brew 'exa'
brew 'fzf'
brew 'z'
brew 'zsh'
brew 'zinit'

brew 'bat'
brew 'cargo-watch'
brew 'chruby'
brew 'cmake' # work
brew 'coreutils'
brew 'dua-cli'
brew 'elasticsearch' # work
brew 'gdal' # work
brew 'gh'
brew 'git'
brew 'git-lfs' # work
brew 'haproxy' # work
brew 'hubflow'
brew 'jq'
brew 'libsodium'
brew 'neovim'
brew 'node' # work
brew 'overmind' # for Procfiles
brew 'pinentry'
brew 'pinentry-mac'
brew 'python'
brew 'rabbitmq' # work
brew 'reattach-to-user-namespace'
brew 'redis' # work
brew 'ripgrep'
brew 'ruby-install'
brew 'shellcheck' # Shell script linter
brew 'starship'
brew 'tmux'
brew 'tmuxinator'
brew 'tokei'
brew 'tree-sitter'

# vi:ft=ruby
