# brew bundle

# Apps
tap 'caskroom/cask'
cask 'caffeine'
cask 'firefox'
cask 'github'
cask 'gitter'
cask 'google-chrome'
cask 'iterm2'
cask 'kindle'
cask 'onyx'
cask 'paw'
cask 'postico'
cask 'sourcetree'
cask 'transmission'

# Shell env
brew 'curl'
brew 'fzf'
brew 'yadm'
brew 'z'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Editing
brew 'neovim'
brew 'reattach-to-user-namespace'
brew 'tmux'

# General dev
brew 'ctags'
brew 'git'
brew 'libsodioum'
brew 'postgis'
brew 'postgresql'
brew 'rabbitmq'
brew 'redis'

# Ruby
brew 'chruby'
brew 'ruby-install'

# JS
brew 'yarn'

# vi:ft=ruby
